import streamlit as st

# Заголовок приложения
st.title("AI Smart Wardrobe")

# Боковое меню для навигации (пригодится для будущих лаб)
st.sidebar.header("Навигация")
page = st.sidebar.selectbox("Выберите этап:", ["Главная", "Загрузка одежды", "Правила стиля"])

if page == "Главная":
    st.write("Добро пожаловать в интеллектуальный стилист!")
    st.write("Этот проект поможет вам подбирать образы на основе ИИ.")
    
    if st.button("Проверить готовность систем"):
        st.success("Все модули (NLP, CV, Logic) инициализированы! 🚀")

elif page == "Загрузка одежды":
    st.header("Загрузка фото")
    uploaded_file = st.file_uploader("Выберите фото вашей вещи...", type=["jpg", "png", "jpeg"])
    if uploaded_file is not None:
        st.image(uploaded_file, caption='Ваше фото', use_column_width=True)
        st.info("На этапе Лабораторной №7 здесь будет работать CV-модель.")

elif page == "Правила стиля":
    st.header("Экспертная система")
    st.write("Здесь будут прописаны правила сочетания цветов и дресс-кода.")